{
    "chapters": [
        {
            "id": 1,
            "title_fr": "Les heures fixées pour les prières",
            "title_ar": "كتاب وقوت الصلاة",
            "sub_chapters": [
                {
                    "id": 1,
                    "title_fr": "Les moments de la prière",
                    "hadiths": [
                        {
                            "hadith_id": 1,
                            "book_ref": "Book 1, Hadith 1",
                            "text_fr": "Ibn Chéhab a rapporté que Omar Ibn Abdel-Aziz avait un jour retardé la prière de l'asr. Ourwa Ibn Al-Zoubair se rendit chez lui et lui raconta que Al-Moughira Ibn Chou'ba avait retardé pour un jour la prière, alors qu'il se trouvait à Koufa; Abou Mass'oud Al-Ansari entra chez lui et dit: \"Que signifie cela ô Moughira ? Ne savais-tu pas que Gabriel descendit du ciel, fit la prière du midi et l'Envoyé d'Allah (paix et bénédiction de Dieu sur lui) la fit également, puis Gabriel fit la prière de l'asr et l'Envoyé d'Allah la fit, puis Gabriel fit la prière du coucher du soleil et l'Envoyé d'Allah la fit également puis Gabriel fit la prière du soir et l'Envoyé d'Allah la fit également, puis Gabriel fit la prière de l'aube et l'Envoyé d'Allah la fit. Par suite Gabriel dit: \"voilà ce qui t'est ordonné\". Et Omar Ibn Abdel-Aziz répondit: \"assure-toi mieux sur ce que tu rapportes ô Ourwa ! Est-ce Gabriel qui a indiqué les moments de la prière à l'Envoyé d'Allah ?\" Ourwa répliqua: \"Je ne fais qu'une répétition de ce que Bachir Ibn Abi Mass'oud Al-Ansari a rapporté d'après son père\".",
                            "text_ar": "قَالَ حَدَّثَنِي يَحْيَى بْنُ يَحْيَى اللَّيْثِيُّ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، أَخَّرَ الصَّلاَةَ يَوْمًا فَدَخَلَ عَلَيْهِ عُرْوَةُ بْنُ الزُّبَيْرِ فَأَخْبَرَهُ أَنَّ الْمُغِيرَةَ بْنَ شُعْبَةَ أَخَّرَ الصَّلاَةَ يَوْمًا وَهُوَ بِالْكُوفَةِ فَدَخَلَ عَلَيْهِ أَبُو مَسْعُودٍ الأَنْصَارِيُّ فَقَالَ مَا هَذَا يَا مُغِيرَةُ أَلَيْسَ قَدْ عَلِمْتَ أَنَّ جِبْرِيلَ نَزَلَ فَصَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ بِهَذَا أُمِرْتُ ‏\"‏ ‏.‏ فَقَالَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ اعْلَمْ مَا تُحَدِّثُ بِهِ يَا عُرْوَةُ أَوَ إِنَّ جِبْرِيلَ هُوَ الَّذِي أَقَامَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَقْتَ الصَّلاَةِ قَالَ عُرْوَةُ كَذَلِكَ كَانَ بَشِيرُ بْنُ أَبِي مَسْعُودٍ الأَنْصَارِيُّ يُحَدِّثُ عَنْ أَبِيهِ ‏.‏"
                        },
                        {
                            "hadith_id": 2,
                            "book_ref": "Book 1, Hadith 2",
                            "text_fr": "Aicha (que Dieu l'agrée), la femme de Prophète (paix et bénédiction de Dieu sur lui) a rapporté que l'Envoyé d'Allah (paix et bénédiction de Dieu sur lui) faisait, dans son appartement, les deux prières du midi et de l'asr avant que le soleil n'y fût trop élevé. (Il faut entendre par là, que l'ombre n'avait pas encore envahi l'appartement de Aicha , la femme du Prophète (paix et bénédiction de Dieu sur lui) ).",
                            "text_ar": "قَالَ عُرْوَةُ وَلَقَدْ حَدَّثَتْنِي عَائِشَةُ زَوْجُ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي الْعَصْرَ وَالشَّمْسُ فِي حُجْرَتِهَا قَبْلَ أَنْ تَظْهَرَ ."
                        },
                        {
                            "hadith_id": 3,
                            "book_ref": "Book 1, Hadith 3",
                            "text_fr": "Ata Ibn Yassar a rapporté qu'un homme vint trouver l'Envoyé d'Allah (paix et bénédiction de Dieu sur lui) et lui demanda le moment de la prière de l'aurore, mais il ne lui répondit pas. Et, lorsque ce fut le lendemain, l'Envoyé d'Allah (paix et bénédiction de Dieu sur lui) fit la prière de l'aurore juste à l'apparition de l'aube, et le surlendemain, il la fit à la clarté du jour, puis demanda: \"où est l'homme qui est venu me demander au sujet de moment de la prière ( de l'aurore )?\" L'homme répondit: \"me voilà ô Envoyé d'Allah. L'Envoyé d'Allah (paix et bénédiction de Dieu sur lui) répliqua: \"il est à situer entre ces deux temps\".",
                            "text_ar": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّهُ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ عَنْ وَقْتِ صَلاَةِ الصُّبْحِ قَالَ فَسَكَتَ عَنْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا كَانَ مِنَ الْغَدِ صَلَّى الصُّبْحَ حِينَ طَلَعَ الْفَجْرُ ثُمَّ صَلَّى الصُّبْحَ مِنَ الْغَدِ بَعْدَ أَنْ أَسْفَرَ ثُمَّ قَالَ \" أَيْنَ السَّائِلُ عَنْ وَقْتِ الصَّلاَةِ \".قَالَ هَا أَنَا ذَا يَا رَسُولَ اللَّهِ . فَقَالَ \" مَا بَيْنَ هَذَيْنِ وَقْتٌ \"."
                        },
                        {
                            "hadith_id": 4,
                            "book_ref": "Book 1, Hadith 4",
                            "text_fr": "Aicha, la femme du Prophète (paix et bénédiction de Dieu sur lui) a rapporté que: \"alors que l'Envoyé d'Allah faisait la prière de l'aurore, les femmes quittaient la mosquée, calfeutrées de leurs manteaux, à tel point qu'on ne les reconnaissait pas dans l'obscurité.\"",
                            "text_ar": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ إِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيُصَلِّي الصُّبْحَ فَيَنْصَرِفُ النِّسَاءُ مُتَلَفِّعَاتٍ بِمُرُوطِهِنَّ مَا يُعْرَفْنَ مِنَ الْغَلَسِ ‏.‏"
                        },
                        {
                            "hadith_id": 5,
                            "book_ref": "Book 1, Hadith 5",
                            "text_fr": "Abou Houraira a rapporté que l'Envoyé d'Allah (paix et bénédiction de Dieu sur lui) a dit: \"Celui qui parvient à faire une raka't de la prière de l'aurore avant l'apparition du soleil, c'est comme s'il a fait la prière à son heure fixe; et celui qui parvient à faire une raka't de la prière de l'asr avant le coucher du soleil, c'est comme s'il a fait la prière à son heure fixe.\"",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، وَعَنْ بُسْرِ بْنِ سَعِيدٍ، وَعَنِ الأَعْرَجِ، كُلُّهُمْ يُحَدِّثُونَهُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏مَنْ أَدْرَكَ رَكْعَةً مِنَ الصُّبْحِ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ فَقَدْ أَدْرَكَ الصُّبْحَ وَمَنْ أَدْرَكَ رَكْعَةً مِنَ الْعَصْرِ قَبْلَ أَنْ تَغْرُبَ الشَّمْسُ فَقَدْ أَدْرَكَ الْعَصْرَ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 6,
                            "book_ref": "Book 1, Hadith 6",
                            "text_fr": "Nafe', esclave de Abdallah Ibn Omar, a rapporté que Omar Ibn Al-Khattab avait écrit à ses préfets: \"la prière est la chose à laquelle je tiens beaucoup d'importance; celui qui la fait à la perfection, et la retient à jamais, aura gardé sa religion. Celui qui la manque, pourra négliger de ce qui est de beaucoup moins important.\" Et il ajoute: \"faites la prière du midi, quand l'ombre d'une chose est d'une coudée, jusqu'à ce que l'ombre de l'un de vous soit aussi longue que sa taille. La prière de l'asr est, tant que le soleil est haut dans le ciel, blanc et pur, et qu'un cavalier puisse faire le parcours de deux parasanges ou trois, avant son coucher; la prière du coucher est à la disparition du soleil; celle du soir, quand disparait le crépuscule jusqu'à l'écoulement du premier tiers de la nuit. Celui qui dort sans la faire, puisse Allah ne le fasse pas dormir. Quant à la prière de l'aurore, vous la faites tant que les étoiles paraissent scintillantes et entremêlées.\"",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَتَبَ إِلَى عُمَّالِهِ إِنَّ أَهَمَّ أَمْرِكُمْ عِنْدِي الصَّلاَةُ فَمَنْ حَفِظَهَا وَحَافَظَ عَلَيْهَا حَفِظَ دِينَهُ وَمَنْ ضَيَّعَهَا فَهُوَ لِمَا سِوَاهَا أَضْيَعُ ‏.‏ ثُمَّ كَتَبَ أَنْ صَلُّوا الظُّهْرَ إِذَا كَانَ الْفَىْءُ ذِرَاعًا إِلَى أَنْ يَكُونَ ظِلُّ أَحَدِكُمْ مِثْلَهُ وَالْعَصْرَ وَالشَّمْسُ مُرْتَفِعَةٌ بَيْضَاءُ نَقِيَّةٌ قَدْرَ مَا يَسِيرُ الرَّاكِبُ فَرْسَخَيْنِ أَوْ ثَلاَثَةً قَبْلَ غُرُوبِ الشَّمْسِ وَالْمَغْرِبَ إِذَا غَرَبَتِ الشَّمْسُ وَالْعِشَاءَ إِذَا غَابَ الشَّفَقُ إِلَى ثُلُثِ اللَّيْلِ فَمَنْ نَامَ فَلاَ نَامَتْ عَيْنُهُ وَالصَّبْحَ وَالنُّجُومُ بَادِيَةٌ مُشْتَبِكَةٌ ‏.‏"
                        },
                        {
                            "hadith_id": 7,
                            "book_ref": "Book 1, Hadith 7",
                            "text_fr": "Omar écrivit à Abou Moussa : \"fais la prière du midi quand le soleil commence à quitter le méridien; la prière de l'asr quand il est blanc et clair avant qu'il ne soit jauni; la prière du coucher du soleil quand celui-ci disparaît; la prière du soir peut être retardée jusqu'à la fin du premier tiers de la nuit; et celle de l'aurore est à faire quand les étoiles sont brillantes et entremêlées. Récite dans cette prière deux longues sourates du 'Moufassal'.\"",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلٍ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَتَبَ إِلَى أَبِي مُوسَى أَنْ صَلِّ الظُّهْرَ، إِذَا زَاغَتِ الشَّمْسُ وَالْعَصْرَ وَالشَّمْسُ بَيْضَاءُ نَقِيَّةٌ قَبْلَ أَنْ يَدْخُلَهَا صُفْرَةٌ وَالْمَغْرِبَ إِذَا غَرَبَتِ الشَّمْسُ وَأَخِّرِ الْعِشَاءَ مَا لَمْ تَنَمْ وَصَلِّ الصُّبْحَ وَالنُّجُومُ بَادِيَةٌ مُشْتَبِكَةٌ وَاقْرَأْ فِيهَا بِسُورَتَيْنِ طَوِيلَتَيْنِ مِنَ الْمُفَصَّلِ ‏.‏"
                        },
                        {
                            "hadith_id": 8,
                            "book_ref": "Book 1, Hadith 8",
                            "text_fr": "Omar Ibn Al-Khattab écrivit à Abou Moussa Al-Ach'ari : \"fais la prière de l'asr tant que le soleil est encore blanc et pur, et qu'un cavalier puisse parcourir une distance de trois parasanges (avant son coucher); celle du soir est à faire en s'étendant jusqu'à l'écoulement du premier tiers de la nuit; et si tu veux la retarder, jusqu'à minuit, qu'il en soit, mais prends garde de ne pas être parmi les insouciants (à ne pas la négliger).\"",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَتَبَ إِلَى أَبِي مُوسَى الأَشْعَرِيِّ أَنْ صَلِّ الْعَصْرَ، وَالشَّمْسُ، بَيْضَاءُ نَقِيَّةٌ قَدْرَ مَا يَسِيرُ الرَّاكِبُ ثَلاَثَةَ فَرَاسِخَ وَأَنْ صَلِّ الْعِشَاءَ مَا بَيْنَكَ وَبَيْنَ ثُلُثِ اللَّيْلِ فَإِنْ أَخَّرْتَ فَإِلَى شَطْرِ اللَّيْلِ وَلاَ تَكُنْ مِنَ الْغَافِلِينَ ‏.‏"
                        },
                        {
                            "hadith_id": 9,
                            "book_ref": "Book 1, Hadith 9",
                            "text_fr": "Abdallah Ibn Rafe', l'affranchi de Oum Salama la femme du Prophète (paix et bénédiction de Dieu sur lui) a demandé à Abou Houraira au sujet des moments de la prière; il lui répondit: \"je vais te les montrer: fais la prière du midi lorsque ton ombre est à la hauteur du taillage, celle de l'asr lorsque ton ombre est de double, celle du coucher du soleil lorsque celui-ci disparaît, et celle du soir dans le temps qui te sépare du tiers de la nuit. La prière de l'aurore est à faire tant qu'il fait toujours nuit.\"",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ زِيَادٍ، عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ، مَوْلَى أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ سَأَلَ أَبَا هُرَيْرَةَ عَنْ وَقْتِ الصَّلاَةِ فَقَالَ أَبُو هُرَيْرَةَ أَنَا أُخْبِرُكَ صَلِّ الظُّهْرَ إِذَا كَانَ ظِلُّكَ مِثْلَكَ وَالْعَصْرَ إِذَا كَانَ ظِلُّكَ مِثْلَيْكَ وَالْمَغْرِبَ إِذَا غَرَبَتِ الشَّمْسُ وَالْعِشَاءَ مَا بَيْنَكَ وَبَيْنَ ثُلُثِ اللَّيْلِ وَصَلِّ الصُّبْحَ بِغَبَشٍ ‏.‏ يَعْنِي الْغَلَسَ ‏.‏"
                        },
                        {
                            "hadith_id": 10,
                            "book_ref": "Book 1, Hadith 10",
                            "text_fr": "Anas Ibn Malek a dit: \"nous faisions la prière de l'asr et l'un de nous pouvait aller au quartier de Bani Awf, et les trouver faisant la même prière.\"",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ كُنَّا نُصَلِّي الْعَصْرَ ثُمَّ يَخْرُجُ الإِنْسَانُ إِلَى بَنِي عَمْرِو بْنِ عَوْفٍ فَيَجِدُهُمْ يُصَلُّونَ الْعَصْرَ ‏.‏"
                        },
                        {
                            "hadith_id": 11,
                            "book_ref": "Book 1, Hadith 11",
                            "text_fr": "Anas Ibn Malek a dit: \"nous faisions la prière de l'asr, et quiconque pouvait se rendre à Qoubaa et le soleil était encore élevé.\"",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ كُنَّا نُصَلِّي الْعَصْرَ ثُمَّ يَذْهَبُ الذَّاهِبُ إِلَى قُبَاءٍ فَيَأْتِيهِمْ وَالشَّمْسُ مُرْتَفِعَةٌ ‏.‏"
                        },
                        {
                            "hadith_id": 12,
                            "book_ref": "Book 1, Hadith 12",
                            "text_fr": "Al-Kassem Ibn Mouhammad a dit: \"Je rencontrais les compagnons du Prophète (paix et bénédiction de Dieu sur lui) ne faisant (toujours) la prière du midi qu'au moment de la fraîcheur.\"",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ قَالَ مَا أَدْرَكْتُ النَّاسَ إِلاَّ وَهُمْ يُصَلُّونَ الظُّهْرَ بِعَشِيٍّ ‏.‏"
                        }
                    ]
                },
                {
                    "id": 2,
                    "title_fr": "Le moment de la prière du Vendredi",
                    "hadiths": [
                        {
                            "hadith_id": 13,
                            "book_ref": "Book 1, Hadith 13",
                            "text_fr": "Souhail Ibn Malek a rapporté d'après son père qu'il a dit: \"Je voyais, le Vendredi, un tapis appartenant à Ali Ibn Abi Taleb, bien étalé sur le mur du côté de la mosquée. Le tapis étant couvert de l'ombre, Omar Ibn Al-Khattab entra dans la mosquée et fit la prière du Vendredi.\" Malek (le père de Souhail) a ajouté: \"ayant terminé la prière, nous nous abandonnions à la sieste de la canicule.\"",
                            "text_ar": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كُنْتُ أَرَى طِنْفِسَةً لِعَقِيلِ بْنِ أَبِي طَالِبٍ يَوْمَ الْجُمُعَةِ تُطْرَحُ إِلَى جِدَارِ الْمَسْجِدِ الْغَرْبِيِّ فَإِذَا غَشِيَ الطِّنْفِسَةَ كُلَّهَا ظِلُّ الْجِدَارِ خَرَجَ عُمَرُ بْنُ الْخَطَّابِ وَصَلَّى الْجُمُعَةَ - قَالَ مَالِكٌ وَالِدُ أَبِي سُهَيْلٍ - ثُمَّ نَرْجِعُ بَعْدَ صَلاَةِ الْجُمُعَةِ فَنَقِيلُ قَائِلَةَ الضَّحَاءِ ‏.‏"
                        },
                        {
                            "hadith_id": 14,
                            "book_ref": "Book 1, Hadith 14",
                            "text_fr": "Ibn Abi Salit a rapporté que Osman Ibn Affan fit la prière du Vendredi à Médine et celle de l'asr à Malal. Et Malek s'explique à ce sujet: \"c'était pour faire la prière à la première heure du midi et pour accélérer la marche.\"",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنِ ابْنِ أَبِي سَلِيطٍ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، صَلَى الْجُمُعَةَ بِالْمَدِينَةِ وَصَلَى الْعَصْرَ بِمَلَلٍ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ لِلتَّهْجِيرِ وَسُرْعَةِ السَّيْرِ ‏.‏"
                        }
                    ]
                },
                {
                    "id": 3,
                    "title_fr": "Celui qui parvient à faire une seule raka't en commun",
                    "hadiths": [
                        {
                            "hadith_id": 15,
                            "book_ref": "Book 1, Hadith 15",
                            "text_fr": "Abou Houraira a rapporté que l'Envoyé d'Allah (paix et bénédiction de Dieu sur lui) a dit: \"Celui qui parvient à faire une seule raka't en commun, c'est comme s'il a fait toute la prière.\"",
                            "text_ar": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَدْرَكَ رَكْعَةً مِنَ الصَّلاَةِ فَقَدْ أَدْرَكَ الصَّلاَةَ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 16,
                            "book_ref": "Book 1, Hadith 16",
                            "text_fr": "AbduBah Ibn Omar Ibn Al Khattab disait: \"si tu as manqué à l'inclinaison en commun, c'est comme si tu as manqué une raka't\" (litt. une prosternation).",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ بْنِ الْخَطَّابِ، كَانَ يَقُولُ إِذَا فَاتَتْكَ الرَّكْعَةُ فَقَدْ فَاتَتْكَ السَّجْدَةُ ‏.‏"
                        },
                        {
                            "hadith_id": 17,
                            "book_ref": "Book 1, Hadith 17",
                            "text_fr": "Abdallah Ibn Omar et Zaid Ibn Thabet disaient: \"Celui qui parvient à faire l'inclinaison en commun, c'est qu'il a accompli une raka't.\"",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، وَزَيْدَ بْنَ ثَابِتٍ، كَانَا يَقُولاَنِ مَنْ أَدْرَكَ الرَّكْعَةَ فَقَدْ أَدْرَكَ السَّجْدَةَ ‏.‏"
                        },
                        {
                            "hadith_id": 18,
                            "book_ref": "Book 1, Hadith 18",
                            "text_fr": "Abou Houraira disait: \"Celui qui parvient à faire l'inclinaison en commun, aura fait une raka't en commun; et celui qui a manqué la récitation de la 'fatiha' (la mère du Livre), c'est qu'il a perdu tant de biens.\"",
                            "text_ar": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ أَبَا هُرَيْرَةَ، كَانَ يَقُولُ مَنْ أَدْرَكَ الرَّكْعَةَ فَقَدْ أَدْرَكَ السَّجْدَةَ وَمَنْ فَاتَهُ قِرَاءَةُ أُمِّ الْقُرآنِ فَقَدْ فَاتَهُ خَيْرٌ كَثِيرٌ ‏.‏"
                        }
                    ]
                },
                {
                    "id": 4,
                    "title_fr": "Le déclin du soleil et l'obscurité de la nuit",
                    "hadiths": [
                        {
                            "hadith_id": 19,
                            "book_ref": "Book 1, Hadith 19",
                            "text_fr": "Abdallah Ibn Omar disait: \"le déclin du soleil signifie le moment où il quitte le méridien.\"",
                            "text_ar": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ دُلُوكُ الشَّمْسِ مَيْلُهَا ‏.‏"
                        },
                        {
                            "hadith_id": 20,
                            "book_ref": "Book 1, Hadith 20",
                            "text_fr": "Abdallah Ibn Abbas disait: \"le déclin du soleil est le moment de l'apparition de l'ombre, et l'obscurité de la nuit est à la tombée de celle-ci, en devenant toute sombre.\"",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، قَالَ أَخْبَرَنِي مُخْبِرٌ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، كَانَ يَقُولُ دُلُوكُ الشَّمْسِ إِذَا فَاءَ الْفَىْءُ وَغَسَقُ اللَّيْلِ اجْتِمَاعُ اللَّيْلِ وَظُلْمَتُهُ ‏.‏"
                        }
                    ]
                },
                {
                    "id": 5,
                    "title_fr": "Le moment fixé de la prière",
                    "hadiths": [
                        {
                            "hadith_id": 21,
                            "book_ref": "Book 1, Hadith 21",
                            "text_fr": "Abdallah Ibn Omar a rapporté que l'Envoyé d'Allah (paix et bénédiction de Dieu sur lui) a dit: \"celui qui manque la prière de l'asr, a perdu sa famille et ses biens.\"",
                            "text_ar": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الَّذِي تَفُوتُهُ صَلاَةُ الْعَصْرِ كَأَنَّمَا وُتِرَ أَهْلَهُ وَمَالَهُ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 22,
                            "book_ref": "Book 1, Hadith 22",
                            "text_fr": "Yahya Ibn Sa'id a rapporté que Omar Ibn Al-Khattab, finissant la prière de l'asr, croisa un homme l'ayant manquée; Omar lui dit: \"qu'est-ce qui t'a empêché de faire l'asr en commun ?\" L'homme présenta une excuse et Omar répliqua: \"tu t'es privé de sa récompense.\"",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، انْصَرَفَ مِنْ صَلاَةِ الْعَصْرِ فَلَقِيَ رَجُلاً لَمْ يَشْهَدِ الْعَصْرَ فَقَالَ عُمَرُ مَا حَبَسَكَ عَنْ صَلاَةِ الْعَصْرِ فَذَكَرَ لَهُ الرَّجُلُ عُذْرًا فَقَالَ عُمَرُ طَفَّفْتَ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَيُقَالُ لِكُلِّ شَىْءٍ وَفَاءٌ وَتَطْفِيفٌ ‏.‏"
                        },
                        {
                            "hadith_id": 23,
                            "book_ref": "Book 1, Hadith 23",
                            "text_fr": "Yahya Ibn Sa'id disait: \"Celui qui prie, devrait faire sa prière à son heure fixe; mais s'il la retarde, il aura perdu sa meilleure récompense ou de ce qui lui vaudrait de mieux que sa famille et ses biens.\" Malek a dit: \"L'homme qui se trouve en voyage et qui retarde sa prière, soit par insouciance soit par oubli, jusqu'à ce qu'il rencontre sa famille, s'il est chez soi et qu'il est à l'heure, qu'il fasse sa prière au complet comme s'il est en ville, mais s'il est présent et que le temps s'est écoulé, qu'il la fasse abrégée, comme celle d'un voyageur, car il ne fera que ce qu'il devait faire (selon le cas).\" Et Malek ajouta: \"C'est ce que j'ai constaté les hommes faire chez nous (à Médine), ainsi que ceux qui sont versés dans la religion.\" Malek a dit aussi: \"le crépuscule est la lueur rouge vue après le coucher du soleil; quand cette lueur disparaît, ce sera le moment de la prière du soir et aura dépassé celui de la prière du coucher du soleil.\"",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ كَانَ يَقُولُ إِنَّ الْمُصَلِّيَ لَيُصَلِّي الصَّلاَةَ وَمَا فَاتَهُ وَقْتُهَا وَلَمَا فَاتَهُ مِنْ وَقْتِهَا أَعْظَمُ - أَوْ أَفْضَلُ - مِنْ أَهْلِهِ وَمَالِهِ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ مَنْ أَدْرَكَ الْوَقْتَ وَهُوَ فِي سَفَرٍ فَأَخَّرَ الصَّلاَةَ سَاهِيًا أَوْ نَاسِيًا حَتَّى قَدِمَ عَلَى أَهْلِهِ أَنَّهُ إِنْ كَانَ قَدِمَ عَلَى أَهْلِهِ وَهُوَ فِي الْوَقْتِ فَلْيُصَلِّ صَلاَةَ الْمُقِيمِ وَإِنْ كَانَ قَدْ قَدِمَ وَقَدْ ذَهَبَ الْوَقْتُ فَلْيُصَلِّ صَلاَةَ الْمُسَافِرِ لأَنَّهُ إِنَّمَا يَقْضِي مِثْلَ الَّذِي كَانَ عَلَيْهِ ‏.‏ قَالَ مَالِكٌ وَهَذَا الأَمْرُ هُوَ الَّذِي أَدْرَكْتُ عَلَيْهِ النَّاسَ وَأَهْلَ الْعِلْمِ بِبَلَدِنَا ‏.‏ وَقَالَ مَالِكٌ الشَّفَقُ الْحُمْرَةُ الَّتِي فِي الْمَغْرِبِ فَإِذَا ذَهَبَتِ الْحُمْرَةُ فَقَدْ وَجَبَتْ صَلاَةُ الْعِشَاءِ وَخَرَجْتَ مِنْ وَقْتِ الْمَغْرِبِ ‏.‏"
                        },
                        {
                            "hadith_id": 24,
                            "book_ref": "Book 1, Hadith 24",
                            "text_fr": "Nafe' a rapporté que Abdallah Ibn Omar fut évanoui et perdit conscience; (reprenant ses sens, il n'a pas fait la prière manquée). Malek a dit: \"Je pense, et Allah sait mieux que quiconque, que le temps s'était écoulé. Quant à celui qui reprend conscience au moment de la prière, il doit la faire.\"",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، أُغْمِيَ عَلَيْهِ فَذَهَبَ عَقْلُهُ فَلَمْ يَقْضِ الصَّلاَةَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ فِيمَا نَرَى - وَاللَّهُ أَعْلَمُ - أَنَّ الْوَقْتَ قَدْ ذَهَبَ فَأَمَّا مَنْ أَفَاقَ فِي الْوَقْتِ فَإِنَّهُ يُصَلِّي ‏.‏"
                        }
                    ]
                },
                {
                    "id": 6,
                    "title_fr": "Le fait de se coucher avant d'accomplir la prière",
                    "hadiths": [
                        {
                            "hadith_id": 25,
                            "book_ref": "Book 1, Hadith 25",
                            "text_fr": "Sa'id Ibn Al-Moussaiab a rapporté: \"en retournant de la bataille de Khaibar, l'Envoyé d'Allah (paix et bénédiction de Dieu sur lui) marcha la nuit\" et lorsqu'il fut presque minuit il campa et dit à Bilal : \"réveille-nous au moment de la prière de l'aurore\". L'Envoyé d'Allah (paix et bénédiction de Dieu sur lui) dormit ainsi que tous ses compagnons; quant à Bilal, il resta éveillé le temps qu'Allah voulut, puis il appuya son dos contre sa monture juste avant l'aube et ses yeux se fermèrent malgré lui. Personne ne se réveilla, ni l'un des compagnons, ni l'Envoyé d'Allah, ni Bilal, juste au moment voulu; ils ne se réveillèrent que sous l'effet de la chaleur solaire. Comme l'Envoyé d'Allah fut surpris, Bilal lui dit: \"ô Envoyé d'Allah, celui qui a enlevé ton âme a enlevé la mienne\". L'Envoyé d'Allah dit aux hommes: \"allons, en route\". Les hommes poussèrent leurs montures et se mirent en route, et après avoir marché une certaine distance, il ordonna à Bilal de faire l'appel à la prière. L'Envoyé d'Allah fit la prière de l'aurore, et une fois la prière achevée, il dit: \"Celui qui omet une prière, qu'il la fasse quand il se rappelle\", car Allah le Béni et le Très-Haut a dit: \"Fais la prière en souvenir de Moi\" (Sourate 20 : Ta-Ha verset 14).",
                            "text_ar": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ قَفَلَ مِنْ خَيْبَرَ أَسْرَى حَتَّى إِذَا كَانَ مِنْ آخِرِ اللَّيْلِ عَرَّسَ وَقَالَ لِبِلاَلٍ ‏\"‏ اكْلأْلَنَا الصُّبْحَ ‏\"‏ ‏.‏ وَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَصْحَابُهُ وَكَلأَ بِلاَلٌ مَا قُدِّرَ لَهُ ثُمَّ اسْتَنَدَ إِلَى رَاحِلَتِهِ وَهُوَ مُقَابِلُ الْفَجْرِ فَغَلَبَتْهُ عَيْنَاهُ فَلَمْ يَسْتَيْقِظْ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلاَ بِلاَلٌ وَلاَ أَحَدٌ مِنَ الرَّكْبِ حَتَّى ضَرَبَتْهُمُ الشَّمْسُ فَفَزِعَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ بِلاَلٌ يَا رَسُولَ اللَّهِ أَخَذَ بِنَفْسِي الَّذِي أَخَذَ بِنَفْسِكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اقْتَادُوا ‏\"‏ ‏.‏ فَبَعَثُوا رَوَاحِلَهُمْ وَاقْتَادُوا شَيْئًا ثُمَّ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِلاَلاً فَأَقَامَ الصَّلاَةَ فَصَلَّى بِهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم الصُّبْحَ ثُمَّ قَالَ حِينَ قَضَى الصَّلاَةَ ‏\"‏ مَنْ نَسِيَ الصَّلاَةَ فَلْيُصَلِّهَا إِذَا ذَكَرَهَا فَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ فِي كِتَابِهِ ‏{‏أَقِمِ الصَّلاَةَ لِذِكْرِي ‏}‏ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 26,
                            "book_ref": "Book 1, Hadith 26",
                            "text_fr": "Zaid Ibn Aslam a rapporté: \"une nuit, allant à la Mecque, l'Envoyé d'Allah fit halte et chargea Bilal de réveiller les hommes au moment de la prière de l'aurore. Bilal se coucha ainsi que tous les hommes. Quand le soleil fut déjà au-dessus de l'horizon, les hommes se réveillèrent tous effrayés; alors l'Envoyé d'Allah leur ordonna de monter et partir pour sortir de la vallée (où ils se trouvaient) en disant: \"un démon se trouve dans cette vallée\". Ils montèrent et quittèrent la vallée, puis l'Envoyé d'Allah leur ordonna de descendre et de faire leurs ablutions et demanda à Bilal d'appeler à la prière. L'Envoyé d'Allah fit la prière de l'aurore en commun; une fois la prière achevée, et s'apercevant de leur frayeur, il leur dit: \"Hommes! Allah a enlevé nos âmes, et s'il le veut, il nous les aura rendues dans d'autres circonstances. Lorsque l'un de vous s'endort sans avoir fait sa prière, ou qu'il a oublié de la faire, qu'il l'accomplisse quand il s'en souvienne, tout comme s'il l'avait accomplie à son heure fixe\". L'Envoyé d'Allah tourna du côté d'Abou Bakr en disant: \"le diable vint surprendre Bilal alors qu'il voulait faire la prière, et l'endormit; il ne cesse de le bercer comme une mère qui dodeline son petit\". Puis Bilal raconta à l'Envoyé d'Allah ce qui s'était passé et Abou Bakr s'écria: \"Je témoigne que tu es l'Envoyé d'Allah\".",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّهُ قَالَ عَرَّسَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْلَةً بِطَرِيقِ مَكَّةَ وَوَكَّلَ بِلاَلاً أَنْ يُوقِظَهُمْ لِلصَّلاَةِ فَرَقَدَ بِلاَلٌ وَرَقَدُوا حَتَّى اسْتَيْقَظُوا وَقَدْ طَلَعَتْ عَلَيْهِمُ الشَّمْسُ فَاسْتَيْقَظَ الْقَوْمُ وَقَدْ فَزِعُوا فَأَمَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَرْكَبُوا حَتَّى يَخْرُجُوا مِنْ ذَلِكَ الْوَادِي وَقَالَ ‏\"‏ إِنَّ هَذَا وَادٍ بِهِ شَيْطَانٌ ‏\"‏ ‏.‏ فَرَكِبُوا حَتَّى خَرَجُوا مِنْ ذَلِكَ الْوَادِي ثُمَّ أَمَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَنْزِلُوا وَأَنْ يَتَوَضَّؤُوا وَأَمَرَ بِلاَلاً أَنْ يُنَادِي بِالصَّلاَةِ أَوْ يُقِيمَ فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالنَّاسِ ثُمَّ انْصَرَفَ إِلَيْهِمْ وَقَدْ رَأَى مِنْ فَزَعِهِمْ فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ إِنَّ اللَّهَ قَبَضَ أَرْوَاحَنَا وَلَوْ شَاءَ لَرَدَّهَا إِلَيْنَا فِي حِينٍ غَيْرِ هَذَا فَإِذَا رَقَدَ أَحَدُكُمْ عَنِ الصَّلاَةِ أَوْ نَسِيَهَا ثُمَّ فَزِعَ إِلَيْهَا فَلْيُصَلِّهَا كَمَا كَانَ يُصَلِّيهَا فِي وَقْتِهَا ‏\"‏ ‏.‏ ثُمَّ الْتَفَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى أَبِي بَكْرٍ فَقَالَ ‏\"‏ إِنَّ الشَّيْطَانَ أَتَى بِلاَلاً وَهُوَ قَائِمٌ يُصَلِّي فَأَضْجَعَهُ فَلَمْ يَزَلْ يُهَدِّئُهُ كَمَا يُهَدَّأُ الصَّبِيُّ حَتَّى نَامَ ‏\"‏ ‏.‏ ثُمَّ دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِلاَلاً فَأَخْبَرَ بِلاَلٌ رَسُولَ اللَّهِ صلى الله عليه وسلم مِثْلَ الَّذِي أَخْبَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَبَا بَكْرٍ فَقَالَ أَبُو بَكْرٍ أَشْهَدُ أَنَّكَ رَسُولُ اللَّهِ ‏.‏"
                        }
                    ]
                },
                {
                    "id": 7,
                    "title_fr": "L'interdiction de faire la prière du midi au moment de la canicule",
                    "hadiths": [
                        {
                            "hadith_id": 27,
                            "book_ref": "Book 1, Hadith 27",
                            "text_fr": "Ata Ibn Yassar a rapporté que l'Envoyé d'Allah (paix et bénédiction de Dieu sur lui) a dit: \"la chaleur étouffante provient de l'émanation de la Géhenne. Lorsque la chaleur devient si ardente, attendez la fraîcheur pour faire la prière (du midi)\". Et il ajouta: \"l'Enfer se plaignit au Seigneur en disant: Seigneur, mes parties se sont dévorées les unes les autres; Allah lui permit d'avoir chaque année deux haleines: une en hiver, et une autre en été\".",
                            "text_ar": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ فَإِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا عَنِ الصَّلاَةِ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ اشْتَكَتِ النَّارُ إِلَى رَبِّهَا فَقَالَتْ يَا رَبِّ أَكَلَ بَعْضِي بَعْضًا ‏.‏ فَأَذِنَ لَهَا بِنَفَسَيْنِ فِي كُلِّ عَامٍ نَفَسٍ فِي الشِّتَاءِ وَنَفَسٍ فِي الصَّيْفِ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 28,
                            "book_ref": "Book 1, Hadith 28",
                            "text_fr": "Abou Houraira a rapporté que l'Envoyé d'Allah (paix et bénédiction de Dieu sur lui) a dit: \"lorsque la chaleur devient suffocante, attendez, pour la prière, le moment de la fraîcheur, car la chaleur a pour origine la Géhenne\". Abou Houraira ajouta que: \"l'Enfer s'est plaint à son Seigneur, qui lui permit d'avoir chaque année deux haleines: une en hiver, et une en été\".",
                            "text_ar": "وَحَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، مَوْلَى الأَسْوَدِ بْنِ سُفْيَانَ عَنْ أَبِي سَلَامَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَعَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا عَنِ الصَّلاَةِ فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ‏\"‏ ‏.‏ وَذَكَرَ ‏\"‏ أَنَّ النَّارَ اشْتَكَتْ إِلَى رَبِّهَا فَأَذِنَ لَهَا فِي كُلِّ عَامٍ بِنَفَسَيْنِ نَفَسٍ فِي الشِّتَاءِ وَنَفَسٍ فِي الصَّيْفِ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 29,
                            "book_ref": "Book 1, Hadith 29",
                            "text_fr": "Abou Houraira a rapporté que l'Envoyé d'Allah (paix et bénédiction de Dieu sur lui) a dit: \"lorsque la chaleur devient si intense, attendez la fraîcheur pour faire la prière, car la chaleur provient de l'ardeur du feu de la Géhenne\".",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا عَنِ الصَّلاَةِ فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ‏\"‏ ‏.‏"
                        }
                    ]
                },
                {
                    "id": 8,
                    "title_fr": "L'interdiction d'entrer dans la mosquée après avoir mangé de l'aîl et secouvrir la bouche",
                    "hadiths": [
                        {
                            "hadith_id": 30,
                            "book_ref": "Book 1, Hadith 30",
                            "text_fr": "Sa'id Ibn Al-Moussaiab a rapporté que l'Envoyé d'Allah (paix et bénédiction de Dieu sur lui) a dit: \"celui qui mange de cette plantation, doit s'écarter de nos mosquées, afin de ne plus nous gêner par l'odeur de l'ail\".",
                            "text_ar": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ فَلاَ يَقْرُبْ مَسَاجِدَنَا يُؤْذِينَا بِرِيحِ الثُّومِ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 31,
                            "book_ref": "Book 1, Hadith 31",
                            "text_fr": "Abdel-Rahman Ibn Al-Moujabbar a rapporté que chaque fois que Salem Ibn Abdallah voyait un homme couvrir sa bouche en priant par son vêtement, il l'attirait avec force par le vêtement jusqu'à ce qu'il le lui écarte de sa bouche.",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْمُجَبَّرِ، أَنَّهُ كَانَ يَرَى سَالِمَ بْنَ عَبْدِ اللَّهِ إِذَا رَأَى الإِنْسَانَ يُغَطِّي فَاهُ وَهُوَ يُصَلِّي جَبَذَ الثَّوْبَ عَنْ فِيهِ جَبْذًا شَدِيدًا حَتَّى يَنْزِعَهُ عَنْ فِيهِ ‏.‏"
                        }
                    ]
                }
            ]
        },
        {
            "id": 2,
            "title_fr": "La pureté rituelle",
            "title_ar": "كتاب الطهارة",
            "sub_chapters": [
                {
                    "id": 1,
                    "title_fr": "Les ablutions",
                    "hadiths": [
                        {
                            "hadith_id": 32,
                            "book_ref": "Book 2, Hadith 1",
                            "text_fr": "Amr Ibn Yahia Al-Mazini a rapporté d'après son père qu'il a dit à Abdallah Ibn Zaid Ibn Assem : «Peux-tu me montrer comment l'Envoyé d'Allah faisait ses ablutions»? Abdallah répondit: «Certes, oui». Il fit apporter de l'eau, versa sur ses deux mains, les lava deux fois, se rinça la bouche, fit entrer de l'eau dans son nez en la reniflant trois fois, puis il se lava le visage trois fois, les bras jusqu'aux coudes deux fois, se frotta la tête avec les mains en les faisant passer d'avant en arrière puis d'arrière en avant, et enfin il se lava les pieds.",
                            "text_ar": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِيهِ، أَنَّهُ قَالَ لِعَبْدِ اللَّهِ بْنِ زَيْدِ بْنِ عَاصِمٍ ... فَغَسَلَ وَجْهَهُ ثَلاَثًا ثُمَّ غَسَلَ يَدَيْهِ مَرَّتَيْنِ إِلَى الْمِرْفَقَيْنِ ثُمَّ مَسَحَ رَأْسَهُ بِيَدَيْهِ ... ثُمَّ غَسَلَ رِجْلَيْهِ ‏.‏"
                        },
                        {
                            "hadith_id": 33,
                            "book_ref": "Book 2, Hadith 2",
                            "text_fr": "Abou Houraira a rapporté que l'Envoyé d'Allah a dit: «quand l'un de vous fait ses ablutions, qu'il fasse pénétrer de l'eau dans son nez, puis qu'il la rejette, et lorsqu'il veut se torcher, qu'il utilise des pierres au nombre impair».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا تَوَضَّأَ أَحَدُكُمْ فَلْيَجْعَلْ فِي أَنْفِهِ مَاءً ثُمَّ لِيَنْثِرْ وَمَنِ اسْتَجْمَرَ فَلْيُوتِرْ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 34,
                            "book_ref": "Book 2, Hadith 3",
                            "text_fr": "Abou Houraira a rapporté que l'Envoyé d'Allah a dit: «Celui qui fait ses ablutions, qu'il fasse entrer l'eau dans ses narines puis qu'il la rejette, celui qui veut se torcher qu'il utilise un nombre impair de pierres».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ ابْنِ شِهَابٍ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ تَوَضَّأَ فَلْيَسْتَنْثِرْ وَمَنِ اسْتَجْمَرَ فَلْيُوتِرْ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 35,
                            "book_ref": "Book 2, Hadith 4",
                            "text_fr": "Yahia a rapporté qu'il a entendu Malek dire: «il n'y a pas de mal, quand l'homme, faisant ses ablutions, puise de l'eau une seule fois pour se rincer la bouche et la fait pénétrer dans ses narines puis la rejeter».",
                            "text_ar": ""
                        },
                        {
                            "hadith_id": 36,
                            "book_ref": "Book 2, Hadith 5",
                            "text_fr": "Abdel-Rahman Ibn Abou Bakr a rapporté: «le jour où mourut Sa'd Ibn Abi Waqas, il entra chez Aicha et demanda de l'eau pour ses ablutions. Aicha lui dit: «Fais les ablutions intègres, car j'ai entendu l'Envoyé d'Allah dire: «malheur aux talons d'être touchés par le feu».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ، قَدْ دَخَلَ عَلَى عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم يَوْمَ مَاتَ سَعْدُ بْنُ أَبِي وَقَّاصٍ فَدَعَا بِوَضُوءٍ فَقَالَتْ لَهُ عَائْشَةُ يَا عَبْدَ الرَّحْمَنِ أَسْبِغِ الْوُضُوءَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ وَيْلٌ لِلأَعْقَابِ مِنَ النَّارِ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 37,
                            "book_ref": "Book 2, Hadith 6",
                            "text_fr": "Osman Ibn Abdel-Rahman a rapporté que son père a dit qu'il a entendu (ou vu) Omar Ibn Al-Khattab faire ses ablutions (en se lavant les pieds) jusqu'à son izar (c-à-d mi-jambes).",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ مُحَمَّدِ بْنِ طَحْلاَءَ، عَنْ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّهُ، سَمِعَ عُمَرَ بْنَ الْخَطَّابِ، يَتَوَضَّأُ بِالْمَاءِ لِمَا تَحْتَ إِزَارِهِ ‏.‏"
                        },
                        {
                            "hadith_id": 38,
                            "book_ref": "Book 2, Hadith 7",
                            "text_fr": "Yahia a dit : «On demanda à Malek au sujet d'un homme qui, en faisant ses ablutions, oublie de se rincer la bouche avant de se laver le visage ou se lave les bras avant le visage. Il répondit : «Celui qui se lave le visage avant de se rincer la bouche, qu'il se rince la bouche sans qu'il se lave de nouveau le visage ; quant à celui qui se lave les bras avant son visage, qu'il se lave le visage puis qu'il se lave les bras de nouveau tant qu'il continue ses ablutions».",
                            "text_ar": "قَالَ يَحْيَى سُئِلَ مَالِكٌ عَنْ رَجُلٍ تَوَضَّأَ فَنَسِيَ فَغَسَلَ وَجْهَهُ قَبْلَ أَنْ يَتَمَضْمَضَ أَوْ غَسَلَ ذِرَاعَيْهِ قَبْلَ أَنْ يَغْسِلَ وَجْهَهُ فَقَالَ أَمَّا الَّذِي غَسَلَ وَجْهَهُ قَبْلَ أَنْ يَتَمَضْمَضَ فَلْيُمَضْمِضْ وَلاَ يُعِدْ غَسْلَ وَجْهِهِ وَأَمَّا الَّذِي غَسَلَ ذِرَاعَيْهِ قَبْلَ وَجْهِهِ فَلْيَغْسِلْ وَجْهَهُ ثُمَّ لِيُعِدْ غَسْلَ ذِرَاعَيْهِ حَتَّى يَكُونَ غَسْلُهُمَا بَعْدَ وَجْهِهِ إِذَا كَانَ ذَلِكَ فِي مَكَانِهِ أَوْ بِحَضْرَةِ ذَلِكَ ‏.‏"
                        },
                        {
                            "hadith_id": 39,
                            "book_ref": "Book 2, Hadith 8",
                            "text_fr": "Yahia a dit : «On interrogea Malek au sujet d'un homme qui prie mais se rappelle qu'en faisant ses ablutions, il a oublié de se rincer la bouche ou de renifler l'eau. Il répondit : «Il ne doit pas refaire sa prière, mais s'il est encore en état de pureté (et veut faire la prière suivante), qu'il se rince la bouche et qu'il renifle l'eau».",
                            "text_ar": "قَالَ يَحْيَى وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ نَسِيَ أَنْ يَتَمَضْمَضَ وَيَسْتَنْثِرَ حَتَّى صَلَّى قَالَ لَيْسَ عَلَيْهِ أَنْ يُعِيدَ صَلاَتَهُ وَلْيُمَضْمِضْ وَيَسْتَنْثِرْ مَا يَسْتَقْبِلُ إِنْ كَانَ يُرِيدُ أَنْ يُصَلِّي ‏.‏"
                        }
                    ]
                },
                {
                    "id": 2,
                    "title_fr": "Les ablutions de l'homme qui s'éveille et veut prier",
                    "hadiths": [
                        {
                            "hadith_id": 40,
                            "book_ref": "Book 2, Hadith 9",
                            "text_fr": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) a dit: «Si l'un de vous s'éveille, qu'il se lave les mains avant qu'il ne débute son ablution, car il ne peut savoir où il a mis ses mains durant son sommeil».",
                            "text_ar": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ فَلْيَغْسِلْ يَدَهُ قَبْلَ أَنْ يُدْخِلَهَا فِي وَضُوئِهِ فَإِنَّ أَحَدَكُمْ لاَ يَدْرِي أَيْنَ بَاتَتْ يَدُهُ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 41,
                            "book_ref": "Book 2, Hadith 10",
                            "text_fr": "Omar Ibn Al-Khattab a dit: «lorsque l'un de vous se couche en s'étendant, qu'il fasse ses ablutions (quand il veut prier)».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ إِذَا نَامَ أَحَدُكُمْ مُضْطَجِعًا فَلْيَتَوَضَّأْ ‏.‏"
                        },
                        {
                            "hadith_id": 42,
                            "book_ref": "Book 2, Hadith 11",
                            "text_fr": "Malek a rapporté d'après Zaid Ibn Aslam, au sujet de l'interprétation de ce verset (le sens): «O vous les croyants! Lorsque vous vous levez pour faire la prière, lavez vos visages, alors, et vos mains jusqu'aux coudes, et passez les mains humides sur vos têtes, et lavez-vous les pieds jusqu'aux chevilles» (Coran V, 6) que cela signifie quand vous vous réveillez».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ تَفْسِيرَ، هَذِهِ الآيَةِ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلاَةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ‏}‏ أَنَّ ذَلِكَ إِذَا قُمْتُمْ مِنَ الْمَضَاجِعِ ‏.‏ يَعْنِي النَّوْمَ ‏.‏ قَالَ يَحْيَى قَالَ"
                        },
                        {
                            "hadith_id": 43,
                            "book_ref": "Book 2, Hadith 12",
                            "text_fr": "Malek a dit: «on ne doit pas faire les ablutions après le saignement du nez, ou à cause d'une blessure d'où coule le sang, ou le pus; et on ne doit pas non plus les faire qu'après la sortie de quelque chose des deux exutoires, ou après un sommeil».",
                            "text_ar": "مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّهُ لاَ يَتَوَضَّأُ مِنْ رُعَافٍ وَلاَ مِنْ دَمٍ وَلاَ مِنْ قَيْحٍ يَسِيلُ مِنَ الْجَسَدِ وَلاَ يَتَوَضَّأُ إِلاَّ مِنْ حَدَثٍ يَخْرُجُ مِنْ ذَكَرٍ أَوْ دُبُرٍ أَوْ نَوْمٍ ‏.‏"
                        },
                        {
                            "hadith_id": 44,
                            "book_ref": null,
                            "text_fr": "Malek a rapporté d'après Nafé qu'Ibn Omar ne faisait pas ses ablutions quand il s'assoupissait assis et même il priait.",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ يَنَامُ جَالِسًا ثُمَّ يُصَلِّي وَلاَ يَتَوَضَّأُ ‏.‏"
                        }
                    ]
                },
                {
                    "id": "3",
                    "title_fr": "Le sujet de l'eau pure pour les ablutions.",
                    "hadiths": [
                        {
                            "hadith_id": 45,
                            "book_ref": "Book 2, Hadith 13",
                            "text_fr": "Abou Houraira a rapporté qu'un homme vint trouver l'Envoyé d'Allah (salallahou alayhi wa salam) et lui dit: «Ô Envoyé d'Allah, nous naviguions en pleine mer, et ne portions que peu d'eau avec nous; ainsi si nous nous en servions pour les ablutions, nous n'aurions plus de quoi boire; devons-nous donc utiliser cette eau pour les ablutions»? Il lui répondit: «l'eau de la mer est purificatrice, et sa pêche est licite».",
                            "text_ar": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ سَعِيدِ بْنِ سَلَمَةَ، - مِنْ آلِ بَنِي الأَزْرَقِ - عَنِ الْمُغِيرَةِ بْنِ أَبِي بُرْدَةَ، - وَهُوَ مِنْ بَنِي عَبْدِ الدَّارِ - أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا نَرْكَبُ الْبَحْرَ وَنَحْمِلُ مَعَنَا الْقَلِيلَ مِنَ الْمَاءِ فَإِنْ تَوَضَّأْنَا بِهِ عَطِشْنَا أَفَنَتَوَضَّأُ بِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ هُوَ الطَّهُورُ مَاؤُهُ الْحِلُّ مَيْتَتُهُ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 46,
                            "book_ref": "Book 2, Hadith 14",
                            "text_fr": "Kabcha bint Ka'b Ibn Malek, la femme d'Ibn Abi Katada le Médinois a rapporté que Abou Katada entra chez elle; elle lui apporta de l'eau pour ses ablutions, or une chatte s'était approchée pour boire de cette eau; il lui inclina le vase jusqu'à ce qu'elle fut rassasiée. Remarquant que je le regardais faire, il me dit: «ô, la fille de mon frère, ça t'étonne»? Je lui répondis: «Oui». Il répliqua: «L'Envoyé d'Allah (salallahou alayhi wa salam) a dit:« ces animaux ne souillent pas l'eau car ils vous fréquentent souvent (c.a.d. qu'ils vivent parmi vous)». Malek a dit: «il n'y a pas mal à cela, à moins que l'homme ne remarque une certaine impureté sur la bouche de cette chatte».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ حُمَيْدَةَ بِنْتِ أَبِي عُبَيْدَةَ بْنِ فَرْوَةَ، عَنْ خَالَتِهَا، كَبْشَةَ بِنْتِ كَعْبِ بْنِ مَالِكٍ - وَكَانَتْ تَحْتَ ابْنِ أَبِي قَتَادَةَ الأَنْصَارِيِّ - أَنَّهَا أَخْبَرَتْهَا أَنَّ أَبَا قَتَادَةَ دَخَلَ عَلَيْهَا فَسَكَبَتْ لَهُ وَضُوءًا فَجَاءَتْ هِرَّةٌ لِتَشْرَبَ مِنْهُ فَأَصْغَى لَهَا الإِنَاءَ حَتَّى شَرِبَتْ قَالَتْ كَبْشَةُ فَرَآنِي أَنْظُرُ إِلَيْهِ فَقَالَ أَتَعْجَبِينَ يَا ابْنَةَ أَخِي قَالَتْ فَقُلْتُ نَعَمْ ‏.‏ فَقَالَ إِنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّهَا لَيْسَتْ بِنَجَسٍ إِنَّمَا هِيَ مِنَ الطَّوَّافِينَ عَلَيْكُمْ أَوِ الطَّوَّافَاتِ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 47,
                            "book_ref": "Book 2, Hadith 15",
                            "text_fr": "Abdel Rahman Ibn Hateb a rapporté que Omar Ibn Al-Khattab sortit à la tête d'une cavalerie dont Amr Ibn Al-As faisait partie, jusqu'à leur arrivée près d'un bassin. Amr Ibn Al-As dit à son propriétaire: «Ô un tel! Les bêtes fauves viennent-elles boire souvent de ton bassin»? Omar Ibn Al-Khattab s'adressant au propriétaire dit: «Ne réponds pas car nous fréquentons souvent ces bêtes, et elles nous fréquentent aussi».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَاطِبٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، خَرَجَ فِي رَكْبٍ فِيهِمْ عَمْرُو بْنُ الْعَاصِ حَتَّى وَرَدُوا حَوْضًا فَقَالَ عَمْرُو بْنُ الْعَاصِ لِصَاحِبِ الْحَوْضِ يَا صَاحِبَ الْحَوْضِ هَلْ تَرِدُ حَوْضَكَ السِّبَاعُ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ يَا صَاحِبَ الْحَوْضِ لاَ تُخْبِرْنَا فَإِنَّا نَرِدُ عَلَى السِّبَاعِ وَتَرِدُ عَلَيْنَا ‏.‏"
                        },
                        {
                            "hadith_id": 48,
                            "book_ref": "Book 2, Hadith 16",
                            "text_fr": "Abdallah Ibn Omar disait souvent: «du temps de l'Envoyé d'Allah (salallahou alayhi wa salam) femmes et hommes faisaient ensemble les ablutions».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ إِنْ كَانَ الرِّجَالُ وَالنِّسَاءُ فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم لَيَتَوَضَّئُونَ جَمِيعًا ‏.‏"
                        }
                    ]
                },
                {
                    "id": "4",
                    "title_fr": " De ce qui n'exige pas à refaire les ablutions",
                    "hadiths": [
                        {
                            "hadith_id": 49,
                            "book_ref": "Book 2, Hadith 17",
                            "text_fr": "La mère d'un fils de Ibrahim Ibn Abdel-Rahman Ibn Awf demanda à Oum Salama la femme du Prophète (salallahou alayhi wa salam): «Je suis une femme qui marche dans des lieux immondes et laisse l'extrémité de mon vêtement traînant» (dois-je faire les ablutions lorsque je veux prier). Elle lui répondit: «L'Envoyé d'Allah (salallahou alayhi wa salam) a dit: «(Le sable) fait débarasser les vêtements de toute impureté».",
                            "text_ar": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عُمَارَةَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أُمِّ وَلَدٍ، لإِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّهَا سَأَلَتْ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ إِنِّي امْرَأَةٌ أُطِيلُ ذَيْلِي وَأَمْشِي فِي الْمَكَانِ الْقَذِرِ قَالَتْ أُمُّ سَلَمَةَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يُطَهِّرُهُ مَا بَعْدَهُ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 50,
                            "book_ref": "Book 2, Hadith 18",
                            "text_fr": "Malek a rapporté qu'il a vu Rabi'a Ibn Abdel-Rahman vomir souvent dans la mosquée, sans quitter ce lieu, et ne refaisait pas ses ablutions même avant la prière. On demanda à Malek au sujet d'un homme qui vomissait en rejetant ce qu'il avait mangé; devait-il refaire ses ablutions? Il répondit: «il pouvait ne pas les refaire, mais qu'il se rince la bouche et la lave».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ رَأَى رَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ يَقْلِسُ مِرَارًا وَهُوَ فِي الْمَسْجِدِ فَلاَ يَنْصَرِفُ وَلاَ يَتَوَضَّأُ حَتَّى يُصَلِّيَ ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ قَلَسَ طَعَامًا هَلْ عَلَيْهِ وُضُوءٌ فَقَالَ لَيْسَ عَلَيْهِ وُضُوءٌ وَلْيَتَمَضْمَضْ مِنْ ذَلِكَ وَلْيَغْسِلْ فَاهُ ‏.‏"
                        },
                        {
                            "hadith_id": 51,
                            "book_ref": "Book 2, Hadith 19",
                            "text_fr": "Nafe' a rapporté que Abdallah Ibn Omar avait embaumé un fils de Sa'id, qui est mort; il l'a porté à la mosquée et a fait sa prière sans ablutions. On demanda à Malek: «doit-on refaire les ablutions après avoir vomi»? Il répondit: «non, mais que l'on se rince la bouche, et qu'on la lave».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، حَنَّطَ ابْنًا لِسَعِيدِ بْنِ زَيْدٍ وَحَمَلَهُ ثُمَّ دَخَلَ الْمَسْجِدَ فَصَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ هَلْ فِي الْقَىْءِ وُضُوءٌ قَالَ لاَ وَلَكِنْ لِيَتَمَضْمَضْ مِنْ ذَلِكَ وَلْيَغْسِلْ فَاهُ وَلَيْسَ عَلَيْهِ وُضُوءٌ ‏.‏"
                        }
                    ]
                },
                {
                    "id": "5",
                    "title_fr": "Le fait de ne pas refaire les ablutions après avoir mangé du rôti",
                    "hadiths": [
                        {
                            "hadith_id": 52,
                            "book_ref": "Book 2, Hadith 20",
                            "text_fr": "Abdallah Ibn Abbas a rapporté que l'Envoyé d'Allah a mangé de l'épaule d'un mouton rôti, puis il fit sa prière sans refaire ses ablutions.",
                            "text_ar": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَكَلَ كَتِفَ شَاةٍ ثُمَّ صَلَّى وَلَمَّ يَتَوَضَّأْ ‏.‏"
                        },
                        {
                            "hadith_id": 53,
                            "book_ref": "Book 2, Hadith 21",
                            "text_fr": "Souwaid Ibn An-Nou'man a rapporté que, l'année de Khaibar, il partit avec l'Envoyé d'Allah et arrivés à Al-Sahaba, l'Envoyé d'Allah fit la prière de l'asr, puis ordonna qu'on apporte du sawiq qu'il mouilla d'eau avant de le manger. Il se contenta de se rincer la bouche, et fit la prière du coucher du soleil sans refaire ses ablutions.",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، مَوْلَى بَنِي حَارِثَةَ عَنْ سُوَيْدِ بْنِ النُّعْمَانِ، أَنَّهُ أَخْبَرَهُ أَنَّهُ، خَرَجَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ خَيْبَرَ حَتَّى إِذَا كَانُوا بِالصَّهْبَاءِ - وَهِيَ مِنْ أَدْنَى خَيْبَرَ - نَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى الْعَصْرَ ثُمَّ دَعَا بِالأَزْوَادِ فَلَمْ يُؤْتَ إِلاَّ بِالسَّوِيقِ فَأَمَرَ بِهِ فَثُرِّيَ فَأَكَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَكَلْنَا ثُمَّ قَامَ إِلَى الْمَغْرِبِ فَمَضْمَضَ وَمَضْمَضْنَا ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏"
                        },
                        {
                            "hadith_id": 54,
                            "book_ref": "Book 2, Hadith 22",
                            "text_fr": "Rabi'a Ibn Abdallah Ibn Al-Houdair a rapporté qu'il a pris son dîner avec Omar Ibn Al-Khattab, puis il pria sans refaire ses ablutions.",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، وَعَنْ صَفْوَانَ بْنِ سُلَيْمٍ، أَنَّهُمَا أَخْبَرَاهُ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ رَبِيعَةَ بْنِ عَبْدِ اللَّهِ بْنِ الْهُدَيْرِ، أَنَّهُ تَعَشَّى مَعَ عُمَرَ بْنِ الْخَطَّابِ ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏"
                        },
                        {
                            "hadith_id": 55,
                            "book_ref": "Book 2, Hadith 23",
                            "text_fr": "Aban Ibn Osman a rapporté qu'Osman Ibn Affan mangea du pain et de la viande, se rinça la bouche, lava les mains et frotta le visage, puis pria sans refaire ses ablutions.",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ، عَنْ أَبَانَ بْنِ عُثْمَانَ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، أَكَلَ خُبْزًا وَلَحْمًا ثُمَّ مَضْمَضَ وَغَسَلَ يَدَيْهِ وَمَسَحَ بِهِمَا وَجْهَهُ ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏"
                        },
                        {
                            "hadith_id": 56,
                            "book_ref": "Book 2, Hadith 24",
                            "text_fr": "On rapporta à Malek que Ali Ibn Abi Taleb et Abdallah Ibn Abbas ne refaisaient pas leurs ablutions après avoir mangé de la viande rôtie.",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، وَعَبْدَ اللَّهِ بْنَ عَبَّاسٍ، كَانَا لاَ يَتَوَضَّآنِ مِمَّا مَسَّتِ النَّارُ ‏.‏"
                        },
                        {
                            "hadith_id": 57,
                            "book_ref": "Book 2, Hadith 25",
                            "text_fr": "Yahia Ibn Sa'id a demandé à Abdallah Ibn Amer Ibn Rabi'a si un homme doit refaire ses ablutions après avoir mangé de la nourriture cuite au feu. Il répondit: «J'ai vu mon père manger du rôti sans refaire ses ablutions».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَأَلَ عَبْدَ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ عَنِ الرَّجُلِ، يَتَوَضَّأُ لِلصَّلاَةِ ثُمَّ يُصِيبُ طَعَامًا قَدْ مَسَّتْهُ النَّارُ أَيَتَوَضَّأُ قَالَ رَأَيْتُ أَبِي يَفْعَلُ ذَلِكَ وَلاَ يَتَوَضَّأُ ‏.‏"
                        },
                        {
                            "hadith_id": 58,
                            "book_ref": "Book 2, Hadith 26",
                            "text_fr": "Jaber Ibn Abdallah Al-Ansari a rapporté qu'il a vu Abou Bakr Al-Siddiq manger du rôti puis faire la prière sans refaire ses ablutions.",
                            "text_ar": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي نُعَيْمٍ، وَهْبِ بْنِ كَيْسَانَ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ الأَنْصَارِيَّ، يَقُولُ رَأَيْتُ أَبَا بَكْرٍ الصِّدِّيقَ أَكَلَ لَحْمًا ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏"
                        },
                        {
                            "hadith_id": 59,
                            "book_ref": "Book 2, Hadith 27",
                            "text_fr": "Mohammed Ibn Al-Mounkader a rapporté que l'Envoyé d'Allah fut convié à un repas; on lui servit du pain et de la viande rôtie, il en mangea puis fit ses ablutions et pria. Plus tard, on lui présenta du reste de ce mets, il en mangea puis fit la prière sans refaire ses ablutions.",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دُعِيَ لِطَعَامٍ فَقُرِّبَ إِلَيْهِ خُبْزٌ وَلَحْمٌ فَأَكَلَ مِنْهُ ثُمَّ تَوَضَّأَ وَصَلَّى ثُمَّ أُتِيَ بِفَضْلِ ذَلِكَ الطَّعَامِ فَأَكَلَ مِنْهُ ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏"
                        },
                        {
                            "hadith_id": 60,
                            "book_ref": "Book 2, Hadith 28",
                            "text_fr": "Abdel Rahman Ibn Yazid Al-Ansari a rapporté qu'Anas ibn Malik, de retour d'Iraq, présenta un mets que le feu avait touché à Abou Talha et Oubai Ibn Ka'b; ils en mangèrent, et Anas fit ses ablutions après avoir mangé, mais Abou Talha et Oubai Ibn Ka'b prièrent sans refaire leurs ablutions.",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ الأَنْصَارِيِّ، أَنَّ أَنَسَ بْنَ مَالِكٍ، قَدِمَ مِنَ الْعِرَاقِ فَدَخَلَ عَلَيْهِ أَبُو طَلْحَةَ وَأُبَىُّ بْنُ كَعْبٍ فَقَرَّبَ لَهُمَا طَعَامًا قَدْ مَسَّتْهُ النَّارُ فَأَكَلُوا مِنْهُ فَقَامَ أَنَسٌ فَتَوَضَّأَ فَقَالَ أَبُو طَلْحَةَ وَأُبَىُّ بْنُ كَعْبٍ مَا هَذَا يَا أَنَسُ أَعِرَاقِيَّةٌ فَقَالَ أَنَسٌ لَيْتَنِي لَمْ أَفْعَلْ ‏.‏ وَقَامَ أَبُو طَلْحَةَ وَأُبَىُّ بْنُ كَعْبٍ فَصَلَّيَا وَلَمْ يَتَوَضَّآ ‏.‏"
                        }
                    ]
                },
                {
                    "id": "6",
                    "title_fr": "Les ablutions intègres",
                    "hadiths": [
                        {
                            "hadith_id": 61,
                            "book_ref": "Book 2, Hadith 29",
                            "text_fr": "Hicham Ibn Ourwa a rapporté d'après son père qu'il demanda à l'Envoyé d'Allah (salallahou alayhi wa salam) au sujet du nettoyage après avoir satisfait un besoin naturel, il répondit : « l'un de vous sera-t-il incapable de trouver trois pierres (pour se torcher) ? »",
                            "text_ar": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنْ الاِسْتِطَابَةِ فَقَالَ ‏\"‏ أَوَلاَ يَجِدُ أَحَدُكُمْ ثَلاَثَةَ أَحْجَارٍ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 60,
                            "book_ref": "Book 2, Hadith 30",
                            "text_fr": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) sortit se rendre au cimetière. Y arrivant, il dit : « que la paix soit sur vous ô demeure des gens croyants, quant à nous, nous vous rejoindrons s'il plut à Allah. Comme j'ai souhaité avoir vu nos frères ». On lui dit : « ô Envoyé d'Allah ne sommes-nous pas tes frères ? » Il répondit : « non, plutôt vous êtes mes compagnons, car nos frères sont ceux qui ne sont pas encore venus. Je vous devancerai au bassin ». On lui demanda : « ô Envoyé d'Allah comment reconnaitras-tu ceux qui ne sont pas encore venus de ta communauté ? » Il répondit : « Pensez-vous que si un homme possède des chevaux qui ont des taches blanches au front et aux pieds, ne les reconnaîtrait-il pas s'ils se trouvaient parmi d'autres chevaux noirs ? » On lui répondit : « Certes oui, ô Envoyé d'Allah ». Il reprit : « (ainsi seront mes frères) qui viendront au jour de la résurrection, ayant des marques brillantes aux fronts et aux pieds, à cause de leurs ablutions, et je les devancerai au bassin. Des hommes de ma communauté seront éloignés de mon bassin comme un chameau égaré, et je les appellerai : « Venez y, venez y, venez y » ! On me répondra : « tu ne sais pas ce qu'ils ont fait après toi ». Je m'écrierai alors : « qu'ils périssent, qu'ils périssent, qu'ils périssent » ! »",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ إِلَى الْمَقْبُرَةِ فَقَالَ ‏\"‏ السَّلاَمُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ وَدِدْتُ أَنِّي قَدْ رَأَيْتُ إِخْوَانَنَا ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ أَلَسْنَا بِإِخْوَانِكَ قَالَ ‏\"‏ بَلْ أَنْتُمْ أَصْحَابِي وَإِخْوَانُنَا الَّذِينَ لَمْ يَأْتُوا بَعْدُ وَأَنَا فَرَطُهُمْ عَلَى الْحَوْضِ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ تَعْرِفُ مَنْ يَأْتِي بَعْدَكَ مِنْ أُمَّتِكَ قَالَ ‏\"‏ أَرَأَيْتَ لَوْ كَانَ لِرَجُلٍ خَيْلٌ غُرٌّ مُحَجَّلَةٌ فِي خَيْلٍ دُهْمٍ بُهْمٍ أَلاَ يَعْرِفُ خَيْلَهُ ‏\"‏ ‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ فَإِنَّهُمْ يَأْتُونَ يَوْمَ الْقِيَامَةِ غُرًّا مُحَجَّلِينَ مِنَ الْوُضُوءِ وَأَنَا فَرَطُهُمْ عَلَى الْحَوْضِ فَلاَ يُذَادَنَّ رِجَالٌ عَنْ حَوْضِي كَمَا يُذَادُ الْبَعِيرُ الضَّالُّ أُنَادِيهِمْ أَلاَ هَلُمَّ أَلاَ هَلُمَّ أَلاَ هَلُمَّ فَيُقَالُ إِنَّهُمْ قَدْ بَدَّلُوا بَعْدَكَ فَأَقُولُ فَسُحْقًا فَسُحْقًا فَسُحْقًا ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 61,
                            "book_ref": "Book 2, Hadith 31",
                            "text_fr": "Houmran, l'affranchi de Osman Ibn Affan, a rapporté qu'Osman s'assit sur le siège de la mosquée ; le muezzin vint lui dire que c'était le moment de la prière. Osman demanda qu'on lui apporte de l'eau, fit ses ablutions puis dit : « par Allah ! je vais vous rapporter un hadith, qui s'il ne se trouvait dans le livre d'Allah, je ne vous l'aurais pas rapporté ». Puis il dit : « J'ai entendu l'Envoyé d'Allah (salallahou alayhi wa salam) dire : « Il n’y a pas un musulman qui ne fait à la perfection ses ablutions, puis fait la prière, sans qu'on lui pardonne les fautes commises entre ce moment même jusqu'à l'accomplissement de la prière suivante ». Malek a dit : « je pense qu'il a fait allusion à ce verset : « Acquittez-vous de la prière aux deux bouts du jour et plusieurs fois au cours de la nuit. Oui les bonnes actions dissipent les mauvaises ; ceci est un rappel pour ceux qui se souviennent » (Coran XI, 114) ».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ حُمْرَانَ، مَوْلَى عُثْمَانَ بْنِ عَفَّانَ أَنَّ عُثْمَانَ بْنَ عَفَّانَ، جَلَسَ عَلَى الْمَقَاعِدِ فَجَاءَ الْمُؤَذِّنُ فَآذَنَهُ بِصَلاَةِ الْعَصْرِ فَدَعَا بِمَاءٍ فَتَوَضَّأَ ثُمَّ قَالَ وَاللَّهِ لأُحَدِّثَنَّكُمْ حَدِيثًا لَوْلاَ أَنَّهُ فِي كِتَابِ اللَّهِ مَا حَدَّثْتُكُمُوهُ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَا مِنِ امْرِئٍ يَتَوَضَّأُ فَيُحْسِنُ وُضُوءَهُ ثُمَّ يُصَلِّي الصَّلاَةَ إِلاَّ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الصَّلاَةِ الأُخْرَى حَتَّى يُصَلِّيَهَا ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 62,
                            "book_ref": "Book 2, Hadith 32",
                            "text_fr": "Abdallah Al-Sanabihi a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) a dit : « lorsque le serviteur croyant se rince la bouche en faisant ses ablutions, ses fautes sortent de sa bouche. Lorsqu'il aspire l'eau par ses narines et la rejette, ses fautes sortent de son nez. Lorsqu'il se lave le visage, ses fautes sortent de son visage et même du bord de ses paupières. Lorsqu'il se lave les mains, ses fautes sortent de ses mains, même du dessous de ses ongles. Lorsqu'il se frotte la tête, ses fautes sortent de sa tête et même de ses oreilles. Lorsqu'il se lave les pieds, ses fautes sortent de ses pieds et du dessous de ses ongles. Enfin, sa marche vers la mosquée et la prière seront pour lui une œuvre surérogatoire ».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ الصُّنَابِحِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا تَوَضَّأَ الْعَبْدُ الْمُؤْمِنُ فَتَمَضْمَضَ خَرَجَتِ الْخَطَايَا مِنْ فِيهِ وَإِذَا اسْتَنْثَرَ خَرَجَتِ الْخَطَايَا مِنْ أَنْفِهِ فَإِذَا غَسَلَ وَجْهَهُ خَرَجَتِ الْخَطَايَا مِنْ وَجْهِهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَشْفَارِ عَيْنَيْهِ فَإِذَا غَسَلَ يَدَيْهِ خَرَجَتِ الْخَطَايَا مِنْ يَدَيْهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَظْفَارِ يَدَيْهِ فَإِذَا مَسَحَ بِرَأْسِهِ خَرَجَتِ الْخَطَايَا مِنْ رَأْسِهِ حَتَّى تَخْرُجَ مِنْ أُذُنَيْهِ فَإِذَا غَسَلَ رِجْلَيْهِ خَرَجَتِ الْخَطَايَا مِنْ رِجْلَيْهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَظْفَارِ رِجْلَيْهِ - قَالَ - ثُمَّ كَانَ مَشْيُهُ إِلَى الْمَسْجِدِ وَصَلاَتُهُ نَافِلَةً لَهُ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 63,
                            "book_ref": "Book 2, Hadith 33",
                            "text_fr": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) a dit : « lorsque l'adorateur musulman (ou croyant) fait ses ablutions et se lave le visage, chaque faute commise par ses yeux sortira avec l'eau (ou avec la dernière goutte d'eau). Lorsqu'il se lave les mains, toute faute qu'il a commise de ses mains sortira avec l'eau (ou avec la dernière goutte d'eau). Lorsqu'il se lave les pieds, chaque faute commise par ses pieds sortira avec l'eau (ou avec la dernière goutte d'eau), et à la fin, il en sera purifié de toute faute ».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا تَوَضَّأَ الْعَبْدُ الْمُسْلِمُ - أَوِ الْمُؤْمِنُ - فَغَسَلَ وَجْهَهُ خَرَجَتْ مِنْ وَجْهِهِ كُلُّ خَطِيئَةٍ نَظَرَ إِلَيْهَا بِعَيْنَيْهِ مَعَ الْمَاءِ - أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ - فَإِذَا غَسَلَ يَدَيْهِ خَرَجَتْ مِنْ يَدَيْهِ كُلُّ خَطِيئَةٍ بَطَشَتْهَا يَدَاهُ مَعَ الْمَاءِ - أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ فَإِذَا غَسَلَ رِجْلَيْهِ خَرَجَتْ كُلُّ خَطِيئَةٍ مَشَتْهَا رِجْلاَهُ مَعَ الْمَاءِ - أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ - حَتَّى يَخْرُجَ نَقِيًّا مِنَ الذُّنُوبِ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 64,
                            "book_ref": "Book 2, Hadith 34",
                            "text_fr": "Anas ibn Malik a rapporté : « J'ai vu l'Envoyé d'Allah (salallahou alayhi wa salam) et ce fut le moment de la prière de l'asr. Comme les hommes ne trouvaient pas de l'eau pour leurs ablutions, on fit apporter à l'Envoyé d'Allah un vase contenant de l'eau, où il y mit sa main. Puis il demanda aux hommes de faire leurs ablutions ». Anas poursuivit : « J'ai vu l'eau jaillir du dessous de ses doigts de telle façon que tous les hommes ont pu faire leurs ablutions ».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَحَانَتْ صَلاَةُ الْعَصْرِ فَالْتَمَسَ النَّاسُ وَضُوءًا فَلَمْ يَجِدُوهُ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِوَضُوءٍ فِي إِنَاءٍ فَوَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذَلِكَ الإِنَاءِ يَدَهُ ثُمَّ أَمَرَ النَّاسَ يَتَوَضَّئُونَ مِنْهُ - قَالَ أَنَسٌ - فَرَأَيْتُ الْمَاءَ يَنْبُعُ مِنْ تَحْتِ أَصَابِعِهِ فَتَوَضَّأَ النَّاسُ حَتَّى تَوَضَّئُوا مِنْ عِنْدِ آخِرِهِمْ ‏.‏"
                        },
                        {
                            "hadith_id": 65,
                            "book_ref": "Book 2, Hadith 35",
                            "text_fr": "Abou Houraira a dit : « Celui qui fait ses ablutions à la perfection puis sort vers la mosquée pour la prière, il sera considéré en prière tant qu'il ne cherchera qu'à prier. Pour chaque pas fait, on lui inscrira une bonne action et on lui effacera une mauvaise. Lorsque l'un de vous se dirigeant vers la mosquée entend le deuxième appel à la prière, qu'il ne hâte pas le pas, car il aura la plus grande récompense, celui qui habite le plus loin de la mosquée ». On demanda à Abou Houraira : « en vertu de quoi, Abou Houraira ? » Il répondit : « à cause de la longueur du trajet qu'il traversera ».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمَدَنِيِّ الْمُجْمِرِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ مَنْ تَوَضَّأَ فَأَحْسَنَ وُضُوءَهُ ثُمَّ خَرَجَ عَامِدًا إِلَى الصَّلاَةِ فَإِنَّهُ فِي صَلاَةٍ مَادَامَ يَعْمِدُ إِلَى الصَّلاَةِ وَإِنَّهُ يُكْتَبُ لَهُ بِإِحْدَى خُطْوَتَيْهِ حَسَنَةٌ وَيُمْحَى عَنْهُ بِالأُخْرَى سَيِّئَةٌ فَإِذَا سَمِعَ أَحَدُكُمُ الإِقَامَةَ فَلاَ يَسْعَ فَإِنَّ أَعْظَمَكُمْ أَجْرًا أَبْعَدُكُمْ دَارًا ‏.‏ قَالُوا لِمَ يَا أَبَا هُرَيْرَةَ قَالَ مِنْ أَجْلِ كَثْرَةِ الْخُطَا ‏.‏"
                        },
                        {
                            "hadith_id": 66,
                            "book_ref": "Book 2, Hadith 36",
                            "text_fr": "On demanda à Sa'id Ibn Al-Moussaiab au sujet du nettoyage avec l'eau après la satisfaction d'un besoin naturel. Il répondit : « cela est exigé des femmes ».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يُسْأَلُ عَنِ الْوُضُوءِ، مِنَ الْغَائِطِ بِالْمَاءِ فَقَالَ سَعِيدٌ إِنَّمَا ذَلِكَ وُضُوءُ النِّسَاءِ ‏.‏"
                        },
                        {
                            "hadith_id": 67,
                            "book_ref": "Book 2, Hadith 37",
                            "text_fr": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) a dit : « si le chien lape du vase de l'un de vous, qu'il lave le vase sept fois ».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا شَرِبَ الْكَلْبُ فِي إِنَاءِ أَحَدِكُمْ فَلْيَغْسِلْهُ سَبْعَ مَرَّاتٍ ‏\"‏ ‏.‏"
                        },
                        {
                            "hadith_id": 68,
                            "book_ref": "Book 2, Hadith 38",
                            "text_fr": "On rapporta à Malek que l'Envoyé d'Allah (salallahou alayhi wa salam) a dit : « restez adroits, vous ne pourrez pas dénombrer vos œuvres ; œuvrez, et sachez que les meilleures de vos œuvres sont les prières, et nul ne fait les ablutions qu'un croyant ».",
                            "text_ar": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ اسْتَقِيمُوا وَلَنْ تُحْصُوا وَاعْمَلُوا وَخَيْرُ أَعْمَالِكُمُ الصَّلاَةُ وَلاَ يُحَافِظُ عَلَى الْوُضُوءِ إِلاَّ مُؤْمِنٌ ‏\"‏ ‏.‏"
                        }
                    ]
                },
                {
                    "id": "7",
                    "title_fr": "Le fait de se frotter la tête et les oreilles",
                    "hadiths": []
                },
                {
                    "id": "8",
                    "title_fr": "Du fait de frotter les bottines (Khouffs)",
                    "hadiths": []
                },
                {
                    "id": "9",
                    "title_fr": "Comment frotter sur les bottines",
                    "hadiths": []
                },
                {
                    "id": "10",
                    "title_fr": "Du saignement du nez",
                    "hadiths": []
                },
                {
                    "id": "11",
                    "title_fr": "Ce qu'on doit faire lors d'un saignement du nez",
                    "hadiths": []
                },
                {
                    "id": "12",
                    "title_fr": "Ce qu'il faut faire quand le sang coule avec abondance",
                    "hadiths": []
                },
                {
                    "id": "13",
                    "title_fr": "Les ablutions après un suintement",
                    "hadiths": []
                },
                {
                    "id": "14",
                    "title_fr": "L'autorisation de ne plus refaire les ablutions, à celui qui a un suintement (dit mazi)",
                    "hadiths": []
                },
                {
                    "id": "15",
                    "title_fr": "Le fait de refaire les ablutions, si l'on touche la verge",
                    "hadiths": []
                },
                {
                    "id": "16",
                    "title_fr": "Un homme qui embrasse sa femme doit faire ses ablutions",
                    "hadiths": []
                },
                {
                    "id": "17",
                    "title_fr": "La lotion à la suite d'une impureté rituelle",
                    "hadiths": []
                },
                {
                    "id": "18",
                    "title_fr": "Devoir faire une lotion, quand les deux parties circoncises (mâle et femelle) se touchent",
                    "hadiths": []
                },
                {
                    "id": "19",
                    "title_fr": "Les ablutions de l'homme à l'état d'impureté rituelle quand il veut se coucher ou manger avant de faire la lotion",
                    "hadiths": []
                },
                {
                    "id": "20",
                    "title_fr": "La prière de celui qui est en état d'impureté rituelle, sa lotion quand il se souvient et le lavage de son vêtement",
                    "hadiths": []
                },
                {
                    "id": "21",
                    "title_fr": "La lotion de la femme qui pareillement à l'homme fait un rêve érotique",
                    "hadiths": []
                },
                {
                    "id": "22",
                    "title_fr": "La lotion après un acte sexuel",
                    "hadiths": []
                },
                {
                    "id": "23",
                    "title_fr": "La lustration pulvérale \"Tayamoum\"",
                    "hadiths": []
                },
                {
                    "id": "24",
                    "title_fr": "Comment faire la lustration pulvérale \"Tayamoum\"",
                    "hadiths": []
                },
                {
                    "id": "25",
                    "title_fr": "La lustration pulvérale de l'homme rituellement impur",
                    "hadiths": []
                },
                {
                    "id": "26",
                    "title_fr": "Ce dont l'homme peut disposer de sa femme, qui a ses menstrues",
                    "hadiths": []
                },
                {
                    "id": "27",
                    "title_fr": "La pureté de la femme qui a ses menstrues",
                    "hadiths": []
                },
                {
                    "id": "28",
                    "title_fr": "Le cas de la femme qui a ses menstrues",
                    "hadiths": []
                },
                {
                    "id": "29",
                    "title_fr": "De la femme qui a une veine qui saigne",
                    "hadiths": []
                },
                {
                    "id": "30",
                    "title_fr": "De l'urine d'un nourrisson",
                    "hadiths": []
                },
                {
                    "id": "31",
                    "title_fr": "Le fait d'uriner debout",
                    "hadiths": []
                },
                {
                    "id": "32",
                    "title_fr": "De l'usage du \"siwak\" (frottoir à dents)",
                    "hadiths": []
                }
            ]
        }
    ]
}